rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
---
  def same_director
    @movie = Movie.find(params[:id])
    movieDirector = @movie.director

      if movieDirector.empty? then
        flash[:notice] = "'#{@movie.title}' has no director info"
        redirect_to movies_path
      else
        @movies = Movie.where(Director: movieDirector)