rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'
---
  def similar_director
      @all_ratings = Movie.all_ratings
      @selected_ratings = params[:ratings] || session[:ratings] || {}

      @movie = Movie.find(params[:id])

      if movieHasDirector?(@movie) then
        @movies = Movie.where(Director: @movie.director)